// булев тип в js

// имеет 2 значения
var isTrue = true;
var isFalse = false;

typeof isTrue; // "boolean"

// Объект обертка Boolean

// логические операторы описаны в отдельном файле

// преобр в к логическому контексту происходит при исп лог. операторов, а также там шже нужны лог значения
// например проверки условий в if, циклах и т.д

// для преобразования можно использовать Boolean() вне констуркторского контекса
// или !! двойное отрицание

// преобразование значений
// 0, пустая строка, undefined, null, NaN -> false
// все остальное true, в т.ч любой объект это true!!



